gap> a:=[[1,2^20], [3^50, - 5^17]];
[ [ 1, 1048576 ], [ 717897987691852588770249, -762939453125 ] ]
gap> b:=[[-37^15, 12^8-17^2], [-100000, 42]];
[ [ -333446267951815307088493, 429981407 ], [ -100000, 42 ] ]
gap> a + b;
[ [ -333446267951815307088492, 431029983 ], 
  [ 717897987691852588670249, -762939453083 ] ]
gap> a - b;
[ [ 333446267951815307088494, -428932831 ], 
  [ 717897987691852588870249, -762939453167 ] ]
gap> a * 10;
[ [ 10, 10485760 ], [ 7178979876918525887702490, -7629394531250 ] ]
gap> 10 * a;
[ [ 10, 10485760 ], [ 7178979876918525887702490, -7629394531250 ] ]
gap> a * 32003;
[ [ 32003, 33557577728 ], [ 22974889300102358398414278747, -24416351318359375 
     ] ]
gap> 32003 * a;
[ [ 32003, 33557577728 ], [ 22974889300102358398414278747, -24416351318359375 
     ] ]
gap> -a;
[ [ -1, -1048576 ], [ -717897987691852588770249, 762939453125 ] ]
gap> a = b;
false
gap> a = a;
true
gap> a - b = a + (-b);
true
gap> -a = (-1) * b;
false
gap> 0 * a;
[ [ 0, 0 ], [ 0, 0 ] ]
gap> a - a;
[ [ 0, 0 ], [ 0, 0 ] ]
gap> Zero(a);
[ [ 0, 0 ], [ 0, 0 ] ]
