gap> iv:=SI_intvec([1,2,3]);
<singular intvec:[ 1, 2, 3 ]>
gap> Length(iv);
3
gap> SI_ToGAP(iv);
[ 1, 2, 3 ]
gap> iv[1];
1
gap> Display(iv);
1,
2,
3 
