gap> r := SI_ring(0,["x","y","z"]);
<singular ring, 3 indeterminates>
gap> SI_vector(r, 4,"1,x,y,z");
<singular vector, 4 entries>
gap> r := SI_ring(0,["x","y","z"]);
<singular ring, 3 indeterminates>
gap> v := SI_vector(r, 4,"1,x,y,z");
<singular vector, 4 entries>
gap> Length(v);
4
